c5/src/BusinessProcesses/Command/Command.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>Command</name>
  <task>Task.UserTask</task>
  <attributes>
    <name>Appearance</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Control</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Display</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Explanation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>DefinedType.CommandSources</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>CatalogRef.Commands</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Performers</name>
    <attributes>
      <name>Mandatory</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Note</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Performer</name>
      <type>
        <types>EnumRef.Roles</types>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Stage</name>
      <type>
        <types>DefinedType.CommandStages</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

c5/src/Enums/CommandPoints/CommandPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CommandPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>Checking</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>Task</name>
  </enumValues>
</mdclass:Enum>

c5/src/BusinessProcesses/Command/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	StandardProcessing = false;
	Fields.Add ( "Display" );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	StandardProcessing = false;
	Presentation = Data.Display;
	
EndProcedure

Function PointToStatus ( RoutePoint ) export
	
	points = BusinessProcesses.Command.RoutePoints;
	if ( RoutePoint = points.Task ) then
		return Enums.CommandPoints.Task;
	elsif ( RoutePoint = points.Checking ) then
		return Enums.CommandPoints.Checking;
	elsif ( RoutePoint = points.Finish ) then
		return Enums.CommandPoints.Finish;
	endif; 
	
EndFunction 

Function StatusToPoint ( Status ) export
	
	points = BusinessProcesses.Command.RoutePoints;
	if ( Status = Enums.CommandPoints.Task ) then
		return points.Task;
	elsif ( Status = Enums.CommandPoints.Checking ) then
		return points.Checking;
	elsif ( Status = Enums.CommandPoints.Finish ) then
		return points.Finish;
	endif; 
	
EndFunction 

#endif
